{
    "chapters": [
        {
            "content": "Mei <b>Tanaka </b>had always known her grandmother's house was peculiar, but it wasn't until her thirteenth birthday that she understood just how peculiar it truly was.\n\nThe house sat at the very edge of Furosato Village, where the cobblestone roads surrendered to wild grass and the carefully tended rice paddies gave way to an ancient forest that the villagers simply called \"the Beyond.\" Grandmother Haru's home seemed to exist in both worlds at once—its front gate opening to the village street, its back garden dissolving into wilderness. The local children whispered that if you climbed over Grandmother Haru's garden wall, you might never find your way back, but Mei had climbed that wall dozens of times and had always returned for dinner.\n\nUntil today.\n\nMei stood at her bedroom window, watching raindrops race down the glass. The gray morning light cast soft shadows across her suitcases, packed and ready for a summer that promised to be both endlessly long and impossibly brief. Her parents had departed for Osaka three days earlier—her father, a botanist, was joining a research expedition to catalog rare plants in the rainforests of Borneo, and her mother, ever the supportive partner, had gone to help prepare.\n\n\"It's only for three months,\" her mother had said, cupping Mei's face in her hands. \"And your grandmother has been asking to spend more time with you. You'll be fourteen when we return—practically grown.\"\n\nMei had nodded dutifully, but the truth was that Grandmother Haru frightened her a little. Not because she was unkind—quite the opposite. Grandmother's kindness extended to everything that breathed and even to some things that, by all reasonable accounts, shouldn't. Mei had once watched her grandmother spend fifteen minutes apologizing to a broken teacup before gluing it back together.\n\nA gentle knock interrupted her thoughts.\n\n\"Your grandmother is here,\" called Mrs. Yoshida, the neighbor who had agreed to watch over Mei until Grandmother Haru arrived. \"Are you ready, dear?\"\n\nMei sighed, fogging the glass. With one finger, she traced a tiny cat in the condensation, giving it whiskers and pointed ears before wiping it away.\n\n\"Coming,\" she said, hefting the smaller of her two suitcases.\n\nGrandmother Haru didn't own a car. She didn't trust them, she said. Instead, she had brought her old wooden handcart, its wheels freshly oiled but still creaking as Mrs. Yoshida helped load Mei's belongings.\n\n\"Thank you for watching over my granddaughter,\" Grandmother Haru said with a deep bow that made her silver bun wobble. She was a small woman, barely taller than Mei herself, dressed in a faded indigo kimono and practical rubber boots that seemed at odds with her traditional attire. A necklace of smooth river stones hung around her neck, each one painted with a character Mei couldn't quite make out.\n\n\"It was no trouble,\" Mrs. Yoshida replied, casting a nervous glance at the dark clouds overhead. \"You should hurry before the rain gets worse.\"\n\nMei bowed politely to Mrs. Yoshida and fell into step beside her grandmother, who hummed softly as she pulled the cart. The wheels left thin tracks in the damp earth as they made their way through the village.\n\n\"You've grown,\" Grandmother said after they had walked in silence for several minutes.\n\n\"Three centimeters since New Year's,\" Mei replied.\n\n\"Not just in height.\" Grandmother glanced sideways at her. \"Your spirit has grown too. I can see it glowing around you.\"\n\nMei didn't know how to respond to that, so she watched her feet instead, carefully stepping over puddles.\n\nThe village center was quiet, with most people sensibly indoors on such a dreary day. They passed the shuttered vegetable stall, the post office with its single flickering light, and the shrine with its red torii gate. At each corner, Grandmother paused to bow slightly toward something Mei couldn't see.\n\nAs they approached the edge of the village, the houses grew farther apart, gardens wilder, and fences more haphazard. Finally, they reached the stone pathway leading to Grandmother Haru's house—a traditional two-story wooden structure with a tiled roof that curled up at the corners like a smile.\n\n\"Welcome home,\" Grandmother said, sliding open the front door.\n\nHome, Mei thought, was not quite the right word. The house smelled of incense, herbs, and something else—something like petrichor, the scent of rain on dry earth, but deeper somehow. Grandmother Haru kept no electric lights, preferring lanterns and candles, which gave each room a warm, shifting glow. Shadows danced on the walls as if alive.\n\n\"Your room is upstairs, the same as always,\" Grandmother said, removing her boots. \"Go settle in. I'll make tea.\"\n\nMei climbed the creaking stairs, her suitcase bumping against each step. The guest room—her room, she supposed—was small but comfortable, with a futon rolled neatly in one corner, a low writing desk, and a window that looked out over the back garden. From this height, she could see beyond the tangled growth of Grandmother's herbs and vegetables to where the true forest began. The rain had stopped, leaving everything gleaming and fresh.\n\nSomething moved at the edge of the trees—something too large to be a rabbit but too small for a deer. Mei pressed her face against the cool glass but could see nothing apart from the stirring of ferns.\n\n\"Curious?\"\n\nMei jumped. Grandmother Haru stood in the doorway, holding a tray with two steaming cups.\n\n\"I just thought I saw something,\" Mei said.\n\n\"The forest is full of somethings.\" Grandmother set the tray on the desk. \"Especially today.\"\n\n\"What's special about today?\"\n\n\"It's a boundary day,\" Grandmother said, as if this explained everything. \"The summer solstice, your birthday, and a waning gibbous moon. Boundaries are thinner on such days.\"\n\n\"Boundaries between what?\"\n\nGrandmother smiled, the fine lines around her eyes deepening. \"Between what is and what might be.\" She handed Mei a cup of tea that smelled of jasmine and something else, something wilder. \"Drink this, then rest. Tonight, we celebrate.\"\n\n\"Celebrate what?\" Mei asked, taking a cautious sip. The tea tasted better than it smelled—sweet with a hint of tartness.\n\n\"Your birthday, of course.\" Grandmother's eyes twinkled. \"And the Lantern Festival.\"\n\n\"I've never heard of a Lantern Festival in June.\"\n\n\"That's because it's not for the village.\" Grandmother patted Mei's hand. \"It's for the forest. Now drink up and rest. We have much to do when the sun sets.\"\n\nAfter Grandmother left, Mei finished her tea, feeling its warmth spread through her limbs. Despite the early hour, a profound drowsiness overcame her. She barely managed to unroll the futon before collapsing onto it, still in her travel clothes.\n\nShe dreamed of paper lanterns floating upward, their lights merging with the stars until she couldn't tell where the earth ended and the sky began. In the dream, small shadowy figures danced around her, their voices like the rustling of leaves, saying a name over and over. Not her name, but one that seemed familiar nonetheless, tugging at her memory like an old forgotten song.\n\nWhen Mei awoke, the room was bathed in golden light. For a disorienting moment, she thought it was still afternoon, but the quality of the light was wrong—too warm, too fluid. She sat up and gasped.\n\nHer room was illuminated by dozens of paper lanterns, each glowing from within with a light that shifted between gold, amber, and palest green. They hung from the ceiling on invisible threads, gently turning.\n\n\"Grandmother?\" Mei called, but her voice came out as a whisper.\n\nShe rose and moved to the window. Outside, the garden had transformed. More lanterns hung from every tree branch, reflected in pools of water that hadn't been there earlier. The plants seemed larger, more vivid, their leaves and flowers phosphorescent in the lantern light.\n\nAnd there were people—no, not people exactly—figures moving among the plants. Some were tiny, no larger than Mei's hand, flitting from flower to flower. Others were tall and slender, their limbs like willow branches. None of them looked quite solid; they shimmered at the edges, as if they might dissolve into light at any moment.\n\nMei rubbed her eyes, but the scene remained.\n\nA soft knock made her turn. The door slid open, and Grandmother Haru entered. She had changed into a formal kimono of midnight blue, embroidered with silver threads that caught the light like dewdrops. Her white hair was adorned with small star-shaped flowers.\n\n\"You're awake,\" she said. \"Good. It's time.\"\n\n\"Time for what? Grandmother, what's happening? Who are those... people in the garden?\"\n\n\"Our guests.\" Grandmother smiled. \"Or rather, we are theirs. The forest allows us to host the festival only because I have kept the old promises.\" She held out a folded garment—a yukata in pale green, patterned with white peonies. \"Put this on. They're waiting to meet you.\"\n\n\"Meet me? Why would they want to meet me?\" Mei accepted the yukata, the fabric cool and silky between her fingers.\n\n\"Because of what you can do. What you can see.\" Grandmother gestured toward the window. \"Not everyone can see them, even on boundary days. But you've always been able to, haven't you? The things that hide in shadows, the movements at the corner of your eye.\"\n\nMei wanted to deny it, but the truth was she had always seen things others didn't—flickers of light with no source, shapes that didn't quite match what cast them, tiny faces peering out from the knotholes of trees.\n\n\"What are they?\" she whispered.\n\n\"The old stories call them yokai, spirits, fae,\" Grandmother replied. \"Names don't matter much. They are the voices of the forest, the memories of the earth. They keep the boundaries between worlds and tend to the wild places.\" She moved to the window and gazed out. \"And they need our help.\"\n\n\"My help? What could I possibly do?\"\n\n\"That,\" Grandmother said, \"is what we're going to find out. But first, we celebrate. Change, then come downstairs. And Mei—\" her expression grew serious, \"—while courtesy is always important, be especially careful tonight. Don't give your name freely, don't accept gifts without offering something in return, and whatever you do, don't promise anything.\"\n\nAfter Grandmother left, Mei changed into the yukata, her fingers trembling slightly as she tied the obi. The garment fit perfectly, as if made for her. Perhaps it had been.\n\nAt the door, she hesitated, suddenly afraid. Beyond this room with its shifting lantern light lay something unknown, something that challenged everything she had believed about the world. Part of her wanted to curl back up on the futon and pull the blanket over her head until her parents returned.\n\nBut another part—a part that had been drowsing her entire life and was now suddenly awake—propelled her forward.\n\nMei slid open the door and stepped into the hallway, where more lanterns guided her path like earthbound stars. As she descended the stairs, she heard music—a flute, a drum, and something else, something like wind chimes but more melodic.\n\nAt the bottom of the stairs, Grandmother waited, holding a lantern of her own—larger than the others, its paper sides painted with intricate black symbols.\n\n\"Ready?\" she asked.\n\nMei took a deep breath and nodded.\n\nGrandmother slid open the back door, and together they stepped into a night that no longer belonged entirely to the world Mei had always known.\n\nThe garden path glowed with more lanterns, leading into the depths of the forest that now seemed to extend infinitely beyond the boundaries of Grandmother's property. The strange figures moved more clearly here—some bowing as Mei and her grandmother passed, others watching with eyes that reflected the lantern light like polished stones.\n\n\"Where are we going?\" Mei whispered.\n\n\"To the center,\" Grandmother replied. \"To the oldest tree, where the first promise was made.\"\n\nAs they walked deeper into the forest, Mei realized that what she had taken for pools of water were actually openings—places where the ground itself had become reflective, showing not their reflections but glimpses of somewhere else: underwater gardens, cloud forests, desert nights.\n\nThe music grew louder, and the lanterns multiplied until it seemed the stars had descended to dance among the trees. Mei caught glimpses of impossible things—a fox with nine tails playing a shamisen, a woman so tall her head was lost among the highest branches, a cluster of children with leaves growing from their hair.\n\nAnd then the path opened onto a clearing, where the largest tree Mei had ever seen stood sentinel. Its trunk was wider than Grandmother's house, its branches creating a cathedral-like canopy overhead. The tree was festooned with thousands of lanterns, their light revealing bark that seemed to flow like water, patterns shifting and changing as she watched.\n\nAt the base of the tree sat a single figure, smaller than Mei had expected given the grandeur of everything else. It appeared to be an elderly man, his skin as textured as tree bark, wearing robes that might have been woven from moss and twilight. \n\n\"Haru-san,\" the figure said, its voice like stones tumbling in a stream. \"You've brought her.\"\n\n\"As promised,\" Grandmother replied, bowing deeply.\n\nThe figure turned its gaze to Mei. Its eyes were not eyes at all, but rather pools of darkness in which tiny lights swam like fish in the night sky.\n\n\"Welcome, Seed-Keeper's daughter,\" it said. \"We have awaited your return.\"\n\n\"I think you're mistaken,\" Mei said, surprised at the steadiness of her own voice. \"I've never been here before.\"\n\nThe figure's laugh was the sound of wind through autumn leaves. \"Not in this form, perhaps. But the forest remembers you.\" It extended a hand, revealing fingers that were partly roots, twining and untwining. \"Come. There is much to show you.\"\n\nMei looked at her grandmother, who nodded encouragingly.\n\nTaking a deep breath, Mei stepped forward into the circle of lantern light, toward a destiny that had been waiting for her since long before she was born—perhaps even since the first seed took root in the first patch of earth, reaching upward toward the sun.\n\nBehind her, the path back to Grandmother Haru's house shimmered and blurred, as insubstantial as a dream upon waking.\n\nThe first chapter of her true story was about to begin.",
            "id": "ae3a2f3d-71d7-4991-93b8-320cf7d7028f",
            "order": 0,
            "title": "Chapter 1: Once"
        },
        {
            "content": "",
            "id": "4b25b8de-7836-4d29-90e9-0ca21f6d9502",
            "order": 1,
            "title": "Chapter 2"
        }
    ],
    "id": "896dec8f-3869-402f-ae4d-eb65dedc4ad0",
    "last_modified": "2025-02-26 09:50:02",
    "settings": {
        "font_size": 16,
        "line_spacing": 1.5,
        "theme": "light"
    },
    "title": "The Lantern Garden"
}